dabit20/rpi_cnc/firmware/3dprinter_auxcontroller.SW4STM32/STM32/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "usb_device.h"
#include "usbd_custom_hid_if.h"
#include "commpackets.h"
#include "housekeeping.h"
#include <math.h>

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

RTC_HandleTypeDef hrtc;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;


/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
extern USBD_HandleTypeDef hUsbDeviceFS;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM2_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

volatile uint16_t ADCresults[NR_AVG_POINTS][NR_ADC_CHANNELS], avgctr=0;	/* ADC result buffer, filled in with DMA */
volatile bool bGotUSBData = false, bGotADCResults = false, IsRunning=false;
volatile int32_t CommTimeoutCtr;		/* Communications timeout downcounter */
uint8_t USBTxBuf[64];

// One modulator and one PID per output channel
OutModulator modulator[NROUTCHANNELS];
OutPID PID[NROUTCHANNELS];
// Thermistor housekeeping structures
Thermistor thermistor[NRTHERMISTORS];

// Device to host packet, type 1
// Note that it cannot be larger than 64 bytes.
#pragma pack(push,1)
typedef struct {
	sPkt_ThermistorValue tv[NRTHERMISTORS];
	sPkt_Endofcommand eoc;
} _d2h_pkt1;
#pragma pack(pop)
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* ADC conversion complete. Set flag, and let main() handle the results and start a new conversion */
void HAL_ADC_ConvCpltCallback ( ADC_HandleTypeDef *hadc) {
	static uint8_t ctr=0;
	if (avgctr==(NR_AVG_POINTS-1))
		bGotADCResults = true;
	if (++ctr == 0)
		HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
}

/* Systick callback. Called at a 1000Hz rate */
void SysTick_callback(void)
{
	float output = 0.0f, err, adcavg;
	static uint8_t pidctr=0, adcconv_ctr=0;
	int j;
	bool bEvalPID;
	uint32_t incr;
	// PID sample time. This routine is called at a 1000Hz rate
	#define PIDSAMPLETIME (0.001f*(float)NROUTCHANNELS)
	#define INVPIDSAMPLETIME (1.0f/(0.001f*(float)NROUTCHANNELS))
	bEvalPID = false;
	PID[pidctr].feedback = 0.0f;
	// Fetch appropriate feedback value
	// Is it a thermistor?
	if (PID[pidctr].inID >= 0 && PID[pidctr].inID < NRTHERMISTORS) {
		if (thermistor[PID[pidctr].inID].bIsValid) {
			PID[pidctr].feedback = thermistor[PID[pidctr].inID].Temperature;
			bEvalPID = true;
		} else {
			PID[pidctr].feedback = 0.0f;
		}
	}
	// Is it an analog input?
	else if (PID[pidctr].inID >= NRTHERMISTORS && PID[pidctr].inID < (NRTHERMISTORS+NRANALOG)) {
		adcavg = 0.0f;
		for (j=0;j<NR_AVG_POINTS;j++) {
			adcavg += (float)ADCresults[j][PID[pidctr].inID];
		}
		adcavg *= (1.0f/(float)NR_AVG_POINTS);
		PID[pidctr].feedback = adcavg;
		bEvalPID = true;
	}
	// Run with feedback = 0.0f? (testing, controlling the modulator output directly using P=1.0f)
	else if (PID[pidctr].inID < 0) {
		PID[pidctr].feedback = 0.0f;
		bEvalPID = true;
	}
	// Evaluate one of the PID controllers
	if (bEvalPID) {
		err = PID[pidctr].command - PID[pidctr].feedback;
		output = err * PID[pidctr].Kp + \
				 PID[pidctr].integrator + \
				 (err - PID[pidctr].preverror)*INVPIDSAMPLETIME*PID[pidctr].Kd + \
				 PID[pidctr].command * PID[pidctr].FF0;
		PID[pidctr].preverror = err;
		if (output >= PID[pidctr].maxlim)
			output = PID[pidctr].maxlim;
		else if (output <= PID[pidctr].minlim)
			output = PID[pidctr].minlim;
		else {
			// Only update integrator when output is not at it's limits.
			PID[pidctr].integrator += PID[pidctr].Ki*err*PIDSAMPLETIME;
		}
	}
	// Update modulator
	PID[pidctr].output = output;
	incr = (uint32_t)(output * 8388608.0f);
	__disable_irq();
	modulator[pidctr].increment = incr;
	__enable_irq();
	// Update PID instance counter
	if (++pidctr >= NROUTCHANNELS)
		pidctr=0;
	// Start a ADC/DMA cycle
	if ((++adcconv_ctr & 0x03) == 0x03) {
		if (++avgctr >= NR_AVG_POINTS)
			avgctr=0;
		HAL_ADC_Start_DMA(&hadc1, (uint32_t *)&ADCresults[avgctr][0], NR_ADC_CHANNELS);
	}
}

/* Timer callback. This is where we run our pulse engine.
 * Note that for efficiency we might unroll the loops later */
void HAL_TIM_PeriodElapsedCallback (TIM_HandleTypeDef *htim)
{
	static uint16_t lowspeedctr = LOWSPEED_DIV;
	int i;
	/* Handle running state and comm timeout */
	if (!IsRunning) {
		// Not running -> outputs disabled
		for (i=0;i<NROUTCHANNELS;i++) {
			HAL_GPIO_WritePin(modulator[i].GPIOport, modulator[i].GPIOpin, GPIO_PIN_RESET);
		}
		if (CommTimeoutCtr > 0) {
			IsRunning = true;
		}
		return;
	} else {
		/* We are running. Decrement timeout counter. If this reaches 0, stop running */
		if (CommTimeoutCtr > 0) {
			CommTimeoutCtr--;
		} else {
			IsRunning = false;
			return;
		}
		/* Decrement lowspeed divisor counter. Check for 0 later */
		lowspeedctr--;
HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
		/* Do modulators. */
#if 1
		for (i=0;i<NROUTCHANNELS;i++) {
			/* modulator needs evaluation? */
			if (modulator[i].Speed == DC_FAST || (modulator[i].Speed == AC_SLOW && !lowspeedctr)) {
				modulator[i].accumulator += modulator[i].increment;
				if (modulator[i].accumulator >= 0x00800000) {
					modulator[i].accumulator -= 0x00800000;
					HAL_GPIO_WritePin(modulator[i].GPIOport, modulator[i].GPIOpin, GPIO_PIN_SET);
					//if (i==3) HAL_GPIO_WritePin (LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);

				} else {
					HAL_GPIO_WritePin(modulator[i].GPIOport, modulator[i].GPIOpin, GPIO_PIN_RESET);
					//if (i==3) HAL_GPIO_WritePin (LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
				}
			}
		}
#endif
		/* Wrap lowspeed counter if it reached 0 */
		if (lowspeedctr==0)
			lowspeedctr = LOWSPEED_DIV;
	}

