dabit20/rpi_cnc/firmware/3dprinter_auxcontroller.SW4STM32/STM32/Src/main.c
}
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
	GPIO_InitTypeDef GPIO_InitStruct;
	int i,j;
	float adcavg, ntcres, logntcres, invT;
	HAL_StatusTypeDef res;
	// Packet used to return thermistor temps to host
	_d2h_pkt1 d2h_pkt1;
	CommTimeoutCtr = 0;

	// We cannot use the preprocessor for this :(
	if (sizeof (_d2h_pkt1) > 64) {
		while (1);
	}
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the system clock */
	SystemClock_Config();

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_ADC1_Init();
	MX_RTC_Init();
	MX_TIM4_Init();
	MX_USB_DEVICE_Init();
	MX_TIM2_Init();

  /* USER CODE BEGIN 2 */
	// Reset ADC result buffer
	for (i=0;i<NR_ADC_CHANNELS;i++) {
		for (j=0;j<NR_AVG_POINTS;j++)
			ADCresults[j][i] = 0;
	}
	// Initialise modulator data structures
	// 12VDC outputs
	modulator[OUTID_DC12V_1].GPIOpin = DC12V_PDM1_Pin; modulator[OUTID_DC12V_1].GPIOport = DC12V_PDM1_GPIO_Port; modulator[OUTID_DC12V_1].Speed = DC_FAST;
	modulator[OUTID_DC12V_1].accumulator = 0; modulator[OUTID_DC12V_1].increment = 0;
	modulator[OUTID_DC12V_2].GPIOpin = DC12V_PDM2_Pin; modulator[OUTID_DC12V_2].GPIOport = DC12V_PDM2_GPIO_Port; modulator[OUTID_DC12V_2].Speed = DC_FAST;
	modulator[OUTID_DC12V_2].accumulator = 0; modulator[OUTID_DC12V_2].increment = 0;
	modulator[OUTID_DC12V_3].GPIOpin = DC12V_PDM3_Pin; modulator[OUTID_DC12V_3].GPIOport = DC12V_PDM3_GPIO_Port; modulator[OUTID_DC12V_3].Speed = DC_FAST;
	modulator[OUTID_DC12V_3].accumulator = 0; modulator[OUTID_DC12V_3].increment = 0;
	// 24VDC outputs
	modulator[OUTID_DC24V_1].GPIOpin = DC24V_PDM1_Pin; modulator[OUTID_DC24V_1].GPIOport = DC24V_PDM1_GPIO_Port; modulator[OUTID_DC24V_1].Speed = DC_FAST;
	modulator[OUTID_DC24V_1].accumulator = 0; modulator[OUTID_DC24V_1].increment = 0;
	modulator[OUTID_DC24V_2].GPIOpin = DC24V_PDM2_Pin; modulator[OUTID_DC24V_2].GPIOport = DC24V_PDM2_GPIO_Port; modulator[OUTID_DC24V_2].Speed = DC_FAST;
	modulator[OUTID_DC24V_2].accumulator = 0; modulator[OUTID_DC24V_2].increment = 0;
	modulator[OUTID_DC24V_3].GPIOpin = DC24V_PDM3_Pin; modulator[OUTID_DC24V_3].GPIOport = DC24V_PDM3_GPIO_Port; modulator[OUTID_DC24V_3].Speed = DC_FAST;
	modulator[OUTID_DC24V_3].accumulator = 0; modulator[OUTID_DC24V_3].increment = 0;
	// 230VAC outputs
	modulator[OUTID_AC230V_1].GPIOpin = AC230V_PDM1_Pin; modulator[OUTID_AC230V_1].GPIOport = AC230V_PDM1_GPIO_Port; modulator[OUTID_AC230V_1].Speed = AC_SLOW;
	modulator[OUTID_AC230V_1].accumulator = 0; modulator[OUTID_AC230V_1].increment = 0;
	modulator[OUTID_AC230V_2].GPIOpin = AC230V_PDM2_Pin; modulator[OUTID_AC230V_2].GPIOport = AC230V_PDM2_GPIO_Port; modulator[OUTID_AC230V_2].Speed = AC_SLOW;
	modulator[OUTID_AC230V_2].accumulator = 0; modulator[OUTID_AC230V_2].increment = 0;
	modulator[OUTID_AC230V_3].GPIOpin = AC230V_PDM3_Pin; modulator[OUTID_AC230V_3].GPIOport = AC230V_PDM3_GPIO_Port; modulator[OUTID_AC230V_3].Speed = AC_SLOW;
	modulator[OUTID_AC230V_3].accumulator = 0; modulator[OUTID_AC230V_3].increment = 0;

	// Initialise PID controllers
	for (i=0;i<NROUTCHANNELS;i++) {
		PID[i].FF0 = 0.0f;
		PID[i].Kp = 0.0f;
		PID[i].Ki = 0.0f;
		PID[i].Kd = 0.0f;
		PID[i].minlim = 0.0f;
		PID[i].maxlim = 1.0f;
		PID[i].command = 0.0f;
		PID[i].inID = -1;
		PID[i].feedback = 0.0f;
		PID[i].integrator = 0.0f;
		PID[i].output = 0.0f;
		PID[i].preverror = 0.0f;
	}
	// Initialise thermistor data structures
	for (i=0;i<NRTHERMISTORS;i++) {
		thermistor[i].RefResistorValue = 4700.0f;
		// Epcos B57540G0104F000 100K NTC coeffs taken from Smoothieware as default. Should at least prevent bogus outputs
		thermistor[i].SteinhartHart[0] = 0.000722378300319346f;		//ln(R)^0
		thermistor[i].SteinhartHart[1] = 0.000216301852054578f;		//ln(R)^1
		thermistor[i].SteinhartHart[2] = 0.0f;						//ln(R)^2, seldom used
		thermistor[i].SteinhartHart[3] = 9.2641025635702e-08f;		//ln(R)^3
		thermistor[i].Temperature = 0.0f;
		thermistor[i].ValidTempMax = 60.0f;			// Room temperature range.
		thermistor[i].ValidTempMin = 5.0f;			// The end application should set more sensible values
		thermistor[i].bIsValid = false;
	}

	// Setup device to host data structure static members
	d2h_pkt1.eoc.id = PKT_ENDOFCOMMAND;
	d2h_pkt1.eoc.len = sizeof(sPkt_Endofcommand);
	for (i=0;i<NRTHERMISTORS;i++) {
		d2h_pkt1.tv[i].ThermistorID = i;
		d2h_pkt1.tv[i].id = PKT_THERMISTOR_VALUE;
		d2h_pkt1.tv[i].len = sizeof(sPkt_ThermistorValue);
	}
	// Reset USB Tx buffer
	memset (USBTxBuf, 0, 64);

  // reset flag
  bGotUSBData = false;

  // Enable USB discovery by pulling DP+ high.
  GPIO_InitStruct.Pin = USB_DP_PULLUP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_WritePin(USB_DP_PULLUP_GPIO_Port, USB_DP_PULLUP_Pin, GPIO_PIN_SET);
  HAL_GPIO_Init(USB_DP_PULLUP_GPIO_Port, &GPIO_InitStruct);

  // Start pulsegen timer
  HAL_TIM_Base_Start_IT(&htim2);

  // Start hard PWM. Not used yet.
#if 0
  HAL_TIM_Base_Start(&htim4);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_4);
#endif
  // Start ADC for the first time
  // (now done in systick) HAL_ADC_Start_DMA(&hadc1, (uint32_t *)&ADCresults[avgctr][0], NR_ADC_CHANNELS);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */


  /* USER CODE BEGIN 3 */
	  // Did we receive ADC data? If so, calculate NTC temperatures
	  if (bGotADCResults) {
		  for (i=0;i<NRTHERMISTORS;i++) {
			  adcavg = 0.0f;
			  for (j=0;j<NR_AVG_POINTS;j++)
				  adcavg += (float)ADCresults[j][i];
			  adcavg *= (1.0f/(float)NR_AVG_POINTS);
			  if (adcavg > 3.0f && adcavg < 4092.0f) {
				  //ntcres = thermistor[i].RefResistorValue * ((float)(4095-ADCresults[i]) / (float)(ADCresults[i]+1));
				  ntcres = thermistor[i].RefResistorValue * ((4095.0f / adcavg)-1.0f);
				  logntcres = log(ntcres);
				  invT = thermistor[i].SteinhartHart[0] + logntcres*thermistor[i].SteinhartHart[1] + logntcres*logntcres*thermistor[i].SteinhartHart[2] + logntcres*logntcres*logntcres*thermistor[i].SteinhartHart[3];
				  invT = 1.0f/invT;
				  invT -= 273.15f;
				  if (invT >= thermistor[i].ValidTempMin && invT <= thermistor[i].ValidTempMax) {
					  thermistor[i].bIsValid = true;
					  thermistor[i].Temperature = invT;
				  } else {
					  thermistor[i].bIsValid = false;
					  thermistor[i].Temperature = invT;
				  }
			  } else {
				  // ADC value is bogus.
				  thermistor[i].bIsValid = false;
				  thermistor[i].Temperature = -1234.0f;
			  }
		  }
		  // restart conversion
		  bGotADCResults = false;
	  }
	  // If we received data, we setup a return transfer.
	  if (bGotUSBData) {
		  bGotUSBData = false;
		  for (i=0;i<NRTHERMISTORS;i++) {
			  d2h_pkt1.tv[i].bIsValid = thermistor[i].bIsValid;
			  d2h_pkt1.tv[i].TempCelcius = thermistor[i].Temperature;
		  }
		  memcpy (USBTxBuf, &d2h_pkt1, sizeof (_d2h_pkt1));
		  USBD_CUSTOM_HID_SendReport(&hUsbDeviceFS, USBTxBuf, 64);
	  }
  }
  /* USER CODE END 3 */

